load_test_results/GET_localhost_api_v2_health.txt
=== GET http://localhost/api/v2/health ===
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        nginx/1.29.3
Server Hostname:        localhost
Server Port:            80

Document Path:          /api/v2/health
Document Length:        34 bytes

Concurrency Level:      10
Time taken for tests:   0.059 seconds
Complete requests:      100
Failed requests:        50
   (Connect: 0, Receive: 0, Length: 50, Exceptions: 0)
Total transferred:      18250 bytes
HTML transferred:       3350 bytes
Requests per second:    1687.02 [#/sec] (mean)
Time per request:       5.928 [ms] (mean)
Time per request:       0.593 [ms] (mean, across all concurrent requests)
Transfer rate:          300.67 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:     2    5   3.2      4      12
Waiting:        1    5   3.2      4      12
Total:          2    5   3.2      4      13

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      5
  75%      8
  80%      9
  90%     11
  95%     12
  98%     12
  99%     13
 100%     13 (longest request)
=== GET http://localhost/api/v2/health ===
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        nginx/1.29.3
Server Hostname:        localhost
Server Port:            80

Document Path:          /api/v2/health
Document Length:        34 bytes

Concurrency Level:      10
Time taken for tests:   0.069 seconds
Complete requests:      100
Failed requests:        50
   (Connect: 0, Receive: 0, Length: 50, Exceptions: 0)
Total transferred:      18250 bytes
HTML transferred:       3350 bytes
Requests per second:    1459.77 [#/sec] (mean)
Time per request:       6.850 [ms] (mean)
Time per request:       0.685 [ms] (mean, across all concurrent requests)
Transfer rate:          260.16 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:     2    6   3.4      5      19
Waiting:        2    6   3.3      5      19
Total:          2    6   3.4      6      19

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      7
  75%      8
  80%      9
  90%     11
  95%     14
  98%     15
  99%     19
 100%     19 (longest request)